Конфигурация/src/Documents/РазмещениеГостей/РазмещениеГостей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазмещениеГостей</name>
  <attributes>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыездаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойГость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокГостей</name>
    <attributes>
      <name>Гость</name>
      <type>
        <types>CatalogRef.Гости</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КемВыдан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ВзаиморасчетыПоБроням/ВзаиморасчетыПоБроням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоБроням</name>
  <comment>Учет оплаты номеров</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/РазмещениеГостей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Выселить(Команда)
	
	// Защита от дурака
	Если ЗначениеЗаполнено(Объект.ДатаВыездаФакт) Тогда
		ПоказатьПредупреждение(, "Гость уже выселен!");
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОВыселении", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Оформить выселение гостя?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОВыселении(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеОДолге = "";
	// Вызываем сервер, чтобы посчитать деньги и записать дату
	ВыполнитьВыселение(СообщениеОДолге);
	
	// Если сервер вернул сообщение о долге - показываем его
	Если ЗначениеЗаполнено(СообщениеОДолге) Тогда
		ПоказатьПредупреждение(, СообщениеОДолге);
	Иначе
		ПоказатьОповещениеПользователя("Готово", , "Гость выселен успешно.");
	КонецЕсли;
	
	// Обновляем данные на экране (появится дата выезда)
	ЭтаФорма.Прочитать();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыселение(СообщениеОДолге)
	
	// 1. Считаем долг (Цена - Оплаты)
	ЦенаПроживания = Объект.Цена;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Взаиморасчеты.Сумма), 0) КАК Оплачено
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоБроням КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.Бронь = &Бронь"; // Ищем все оплаты по этой брони
		
	Запрос.УстановитьПараметр("Бронь", Объект.Бронь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Оплачено = 0;
	Если Выборка.Следующий() Тогда
		Оплачено = Выборка.Оплачено;
	КонецЕсли;
	
	Долг = ЦенаПроживания - Оплачено;
	
	// Если долг > 1 рубля (защита от копеек), формируем грозное сообщение
	Если Долг > 1 Тогда
		СообщениеОДолге = "ВНИМАНИЕ! У гостя долг: " + Долг + " руб. Требуйте оплату!";
	КонецЕсли;
	
	// 2. Ставим штамп выезда
	// Берем реальный объект документа, чтобы записать его
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ДатаВыездаФакт = ТекущаяДата();
	
	// 3. Сохраняем и проводим
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// Обновляем форму
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры







&НаКлиенте
Процедура БроньПриИзменении(Элемент)
	
	// Если очистили поле - выходим
	Если Объект.Бронь.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Идем на сервер за данными этой брони
	Данные = ПолучитьДанныеБрони(Объект.Бронь);
	
	// Заполняем шапку
	Объект.ОсновнойГость = Данные.ОсновнойГость;
	Объект.ДатаЗаезда = Данные.ДатаЗаезда;
	Объект.ДатаВыезда = Данные.ДатаВыезда;
	Объект.Цена = Данные.Цена;
	
	// Заполняем "Номер" (если его нет на форме, добавьте его в реквизиты объекта!)
	// Судя по скрину, поля "Номер" я не вижу, но оно критически важно.
	// Если оно есть в объекте, но скрыто - ок. Если нет - добавьте.
	// Объект.Номер = Данные.БронируемыйНомер; 
	
	// Добавляем гостя в таблицу, если она пустая
	Если Объект.СписокГостей.Количество() = 0 Тогда
		НоваяСтрока = Объект.СписокГостей.Добавить();
		НоваяСтрока.Гость = Данные.ОсновнойГость;
		// Если паспортные данные хранятся в справочнике Гости - подтянем их
		ЗаполнитьПаспортГостя(НоваяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеБрони(БроньСсылка)
	
	// Возвращаем структуру с данными брони
	Рез = Новый Структура;
	Рез.Вставить("ОсновнойГость", БроньСсылка.ОсновнойГость);
	Рез.Вставить("ДатаЗаезда", БроньСсылка.ДатаЗаезда);
	Рез.Вставить("ДатаВыезда", БроньСсылка.ДатаВыезда);
	Рез.Вставить("БронируемыйНомер", БроньСсылка.БронируемыйНомер);
	Рез.Вставить("Цена", БроньСсылка.Цена); // Цена всего проживания
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПаспортГостя(СтрокаТаблицы)
	// Эту функцию надо вызывать, когда гость меняется в таблице
	ДанныеПаспорта = ПолучитьПаспортНаСервере(СтрокаТаблицы.Гость);
	СтрокаТаблицы.ВидДокумента = ДанныеПаспорта.ВидДокумента;
	СтрокаТаблицы.СерияНомер = ДанныеПаспорта.СерияНомер;
	СтрокаТаблицы.ДатаВыдачи = ДанныеПаспорта.ДатаВыдачи;
	СтрокаТаблицы.КемВыдан = ДанныеПаспорта.КемВыдан;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПаспортНаСервере(ГостьСсылка)
	Рез = Новый Структура("ВидДокумента, СерияНомер, ДатаВыдачи, КемВыдан");
	// Копируем поля из справочника Гости
	ЗаполнитьЗначенияСвойств(Рез, ГостьСсылка);
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура СписокГостейГостьПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокГостей.ТекущиеДанные;
	ЗаполнитьПаспортГостя(ТекСтрока);
КонецПроцедуры
